from collections import Counter

# Определяем список выданных чеков за неделю
chek = [8734, 2345, 8201, 6621, 9999, 1234, 5678, 8201, 8888, 4321, 3365,
        1478, 9865, 5555, 7777, 9998, 1111, 2222, 3333, 4444, 5556, 6666,
        5410, 7778, 8889, 4445, 1439, 9604, 8201, 3365, 7502, 3016, 4928,
        5837, 8201, 2643, 5017, 9682, 8530, 3250, 7193, 9051, 4506, 1987,
        3365, 5410, 7168, 7777, 9865, 5678, 8201, 4445, 3016, 4506, 4506]

# Вычисляем количество выданных чеков
individ = len(chek)
print("Количество выданных чеков за неделю:", individ)

# Вычисляем количество разных посетителей
client = len(set(chek))
print("Количество разных посетителей:", client)

# Создаем объект Counter для подсчета посещений каждого работника
con = Counter(chek)

# Находим наиболее часто встречающегося работника и его количество посещений
most_1 = con.most_common(1)

most = most_1[0][0]
count = most_1[0][1]

# Выводим результаты на экран
print(f"Работник номер: {most} посетил ресторан {count} раз")