from pprint import *
user = input("выберите действие 1: информация о сотруднике или 2: добавление нового сотрудника")

if user == "2":
    dic = {
        10: {"ключ": 43521, "доступ": True, "статус": "работает"},
        11: {"ключ": 53245, "доступ": True, "статус": "работает"},
        12: {"ключ": 14532, "доступ": True, "статус": "не работает"},
        13: {"ключ": 12342, "доступ": False, "статус": "работает"},
        14: {"ключ": 86797, "доступ": True, "статус": "работает"},
        15: {"ключ": 68734, "доступ": False, "статус": "работает"},
    }

    new_dic = dic.copy()

    while True:
        key = input("Введите новый ключ или нажмите Enter для выхода: ")
        if key == "":
            break

        new_info = {}
        new_info["ключ"] = int(input("Введите значение ключ-карты для {}: ".format(key)))
        new_info["доступ"] = bool(input("Введите значение доступа к засереченым материалам (True/False) для {}: ".format(key)))
        new_info["статус"] = input("Введите значение статуса для {}: ".format(key))

        new_dic[key] = new_info
    pprint(new_dic)

elif user == "1":
    req = int(input("введите id сотрудника"))
    dic = {
        10: {"ключ": 43521, "доступ": True, "статус": "работает"},
        11: {"ключ": 53245, "доступ": True, "статус": "работает"},
        12: {"ключ": 14532, "доступ": True, "статус": "не работает"},
        13: {"ключ": 12342, "доступ": False, "статус": "работает"},
        14: {"ключ": 86797, "доступ": True, "статус": "работает"},
        15: {"ключ": 68734, "доступ": False, "статус": "в отпуске"},
        None: {"ключ": None, "доступ": False},
    }
    res = dic.get(req)
    if not res:
        res = dic[None]
    k = res.get("ключ")
    c = res.get("доступ")
    b = res.get("статус")
    print("номер ключ-карты:", k, "Доступ к засереченым материалам", c, "статус сотрудника:", b)
else:
    print("не верное значение")
